Jackhenry/Configs/9.9/ci-jackhenry-create_loan.json

{
    "xsd_name": "TPG_DepositMaster",
    "xml_template": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n    <SOAP-ENV:Header>\n        <wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\" xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">\n            <wsse:UsernameToken xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\">\n                <wsse:Username>{{XUserName}}</wsse:Username>\n                <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText\">{{XPassword}}</wsse:Password>\n                <wsu:Created xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">{{current_timestamp}}</wsu:Created>\n            </wsse:UsernameToken>\n        </wsse:Security>\n    </SOAP-ENV:Header>\n    <SOAP-ENV:Body>\n        <AcctAdd xmlns=\"http://jackhenry.com/jxchange/TPG/2008\">\n            <MsgRqHdr>\n                <jXchangeHdr>\n                    <JxVer />\n                    <AuditUsrId>{{XAuditUser}}</AuditUsrId>\n                    <AuditWsId>{{XAuditWorkStation}}</AuditWsId>\n                    <AuthenUsrId />\n                    <ConsumerName />\n                    <ConsumerProd />\n                    <Ver_1 />\n                    <jXLogTrackingId>{{guid}}</jXLogTrackingId>\n                    <Ver_2 />\n                    <InstRtId>{{XInstitutionRoutingID}}</InstRtId>\n                    <InstEnv>{{XEnvironment}}</InstEnv>\n                    <Ver_3 />\n                    <BusCorrelId>{{guid}}</BusCorrelId>\n                    <Ver_4 />\n                    <WorkflowCorrelId />\n                    <Ver_5 />\n                    <ValidConsmName>{{XValidConsumerName}}</ValidConsmName>\n                    <ValidConsmProd>{{XValidConsumerProduct}}</ValidConsmProd>\n                    <Ver_6 />\n                </jXchangeHdr>\n                <Ver_1 />\n                <Ver_2 />\n                <Ver_3 />\n            </MsgRqHdr>\n\n            <ErrOvrRdInfoArray>\n                <ErrOvrRd>\n                    <ErrCode />\n                    <Ver_1 />\n                    <BusSvcType />\n                    <Ver_2 />\n                </ErrOvrRd>\n                <ErrOvrRd>\n                    <ErrCode />\n                    <Ver_1 />\n                    <BusSvcType />\n                    <Ver_2 />\n                </ErrOvrRd>\n            </ErrOvrRdInfoArray>\n\n            <AccountId>\n                <AcctId>{{AccountId.AcctId}}</AcctId>\n                <AcctType>{{AccountId.AcctType}}</AcctType>\n            </AccountId>\n\n            <LnAdd>\n                <LnInfoRec>\n                    <Term>\n                        <TermCnt>{{LnAdd.LnInfoRec.Term.TermCnt}}</TermCnt>\n                        <TermUnits>{{LnAdd.LnInfoRec.Term.TermUnits}}</TermUnits>\n                    </Term>\n                    <RemPmtCnt>{{LnAdd.LnInfoRec.RemPmtCnt}}</RemPmtCnt>\n                    <PmtDayOfMonth>{{LnAdd.LnInfoRec.PmtDayOfMonth}}</PmtDayOfMonth>\n                    <PmtTermUnits>{{LnAdd.LnInfoRec.PmtTermUnits}}</PmtTermUnits>\n                    <PmtTerm>{{LnAdd.LnInfoRec.PmtTerm}}</PmtTerm>\n                    <PmtCode>{{LnAdd.LnInfoRec.PmtCode}}</PmtCode>\n                    <PmtAmt>{{LnAdd.LnInfoRec.PmtAmt}}</PmtAmt>\n                    <PIAmt>{{LnAdd.LnInfoRec.PIAmt}}</PIAmt>\n                    <OrigBal>{{LnAdd.LnInfoRec.OrigBal}}</OrigBal>\n                    <OpenDt>{{LnAdd.LnInfoRec.OpenDt}}</OpenDt>\n                    <OffCode>{{LnAdd.LnInfoRec.OffCode}}</OffCode>\n                    <MatDt>{{LnAdd.LnInfoRec.MatDt}}</MatDt>\n                    <IntRate>{{LnAdd.LnInfoRec.IntRate}}</IntRate>\n                    <BrCode>{{LnAdd.LnInfoRec.BrCode}}</BrCode>\n                    <ProdCode>{{LnAdd.LnInfoRec.ProdCode}}</ProdCode>\n                    <AcctStat>{{LnAdd.LnInfoRec.AcctStat}}</AcctStat>\n                    <CustId>{{LnAdd.LnInfoRec.CustId}}</CustId>\n                    <OddDaysIntBasis>{{LnAdd.LnInfoRec.OddDaysIntBasis}}</OddDaysIntBasis>\n                </LnInfoRec>\n\n                <LnAcctInfo>\n                    <SubPrimeLnCode>{{LnAdd.LnAcctInfo.SubPrimeLnCode}}</SubPrimeLnCode>\n                    <State>{{LnAdd.LnAcctInfo.State}}</State>\n                    <PurpCode>{{LnAdd.LnAcctInfo.PurpCode}}</PurpCode>\n                    <PrtPastDueNotCode>{{LnAdd.LnAcctInfo.PrtPastDueNotCode}}</PrtPastDueNotCode>\n                    <OrigLnToValRatio>{{LnAdd.LnAcctInfo.OrigLnToValRatio}}</OrigLnToValRatio>\n                    <LateChgCode>{{LnAdd.LnAcctInfo.LateChgCode}}</LateChgCode>\n                    <DeptCode>{{LnAdd.LnAcctInfo.DeptCode}}</DeptCode>\n                    <CurLnToValRatio>{{LnAdd.LnAcctInfo.CurLnToValRatio}}</CurLnToValRatio>\n                    <CrRatingCode>{{LnAdd.LnAcctInfo.CrRatingCode}}</CrRatingCode>\n                    <CollatCode>{{LnAdd.LnAcctInfo.CollatCode}}</CollatCode>\n                    <AnnIncmAmt>{{LnAdd.LnAcctInfo.AnnIncmAmt}}</AnnIncmAmt>\n                    <AcctClsfCode>{{LnAdd.LnAcctInfo.AcctClsfCode}}</AcctClsfCode>\n                    <CombLTV>{{LnAdd.LnAcctInfo.CombLTV}}</CombLTV>\n                    <CrScoreId>{{LnAdd.LnAcctInfo.CrScoreId}}</CrScoreId>\n                    <MoIncmAmt>{{LnAdd.LnAcctInfo.MoIncmAmt}}</MoIncmAmt>\n                    <NumBorw>{{LnAdd.LnAcctInfo.NumBorw}}</NumBorw>\n                    <TotDebtPct>{{LnAdd.LnAcctInfo.TotDebtPct}}</TotDebtPct>\n                    <CrBureauRptCode>{{LnAdd.LnAcctInfo.CrBureauRptCode}}</CrBureauRptCode>\n                    <PrtCouponBook>{{LnAdd.LnAcctInfo.PrtCouponBook}}</PrtCouponBook>\n                </LnAcctInfo>\n\n                <LnBalDtInfo>\n                    <FirstPmtDt>{{LnAdd.LnBalDtInfo.FirstPmtDt}}</FirstPmtDt>\n                </LnBalDtInfo>\n\n                <LnPmtInfo>\n                    <UsePmtSusp>{{LnAdd.LnPmtInfo.UsePmtSusp}}</UsePmtSusp>\n                    <BilLeadDays>{{LnAdd.LnPmtInfo.BilLeadDays}}</BilLeadDays>\n                </LnPmtInfo>\n\n                <LnRateInfo>\n                    <RateVarCode>{{LnAdd.LnRateInfo.RateVarCode}}</RateVarCode>\n                    <RateVar>{{LnAdd.LnRateInfo.RateVar}}</RateVar>\n                    <RateFlr>{{LnAdd.LnRateInfo.RateFlr}}</RateFlr>\n                    <RateCeil>{{LnAdd.LnRateInfo.RateCeil}}</RateCeil>\n                </LnRateInfo>\n\n                <LnRealEstateInfo>\n                    <PropStreet>{{LnAdd.LnRealEstateInfo.PropStreet}}</PropStreet>\n                    <PropState>{{LnAdd.LnRealEstateInfo.PropState}}</PropState>\n                    <PropPostalCode>{{LnAdd.LnRealEstateInfo.PropPostalCode}}</PropPostalCode>\n                    <PropCity>{{LnAdd.LnRealEstateInfo.PropCity}}</PropCity>\n                    <FloodInsurCode>{{LnAdd.LnRealEstateInfo.FloodInsurCode}}</FloodInsurCode>\n                    <ApprVal>{{LnAdd.LnRealEstateInfo.ApprVal}}</ApprVal>\n                    <ApprDt>{{LnAdd.LnRealEstateInfo.ApprDt}}</ApprDt>\n                    <OccupCode>{{LnAdd.LnRealEstateInfo.OccupCode}}</OccupCode>\n                    <PropCounty>{{LnAdd.LnRealEstateInfo.PropCounty}}</PropCounty>\n                </LnRealEstateInfo>\n\n                <LnRegRptInfo>\n                    <NAICSCode>{{LnAdd.LnRegRptInfo.NAICSCode}}</NAICSCode>\n                    <CallRptCode>{{LnAdd.LnRegRptInfo.CallRptCode}}</CallRptCode>\n                    <Req1098>{{LnAdd.LnRegRptInfo.Req1098}}</Req1098>\n                    <SBAGuarPct>{{LnAdd.LnRegRptInfo.SBAGuarPct}}</SBAGuarPct>\n                    <SBAGuarId>{{LnAdd.LnRegRptInfo.SBAGuarId}}</SBAGuarId>\n                    <SBABasisPts>{{LnAdd.LnRegRptInfo.SBABasisPts}}</SBABasisPts>\n                    <GLCostCtr>{{LnAdd.LnRegRptInfo.GLCostCtr}}</GLCostCtr>\n                </LnRegRptInfo>\n            </LnAdd>\n\n            <RegDetail>\n                <ReqLegalEntityType>{{LnAdd.RegDetail.ReqLegalEntityType}}</ReqLegalEntityType>\n                <BenflOwnExclCode>{{LnAdd.RegDetail.BenflOwnExclCode}}</BenflOwnExclCode>\n                <AnnRevenueAmt>{{LnAdd.RegDetail.AnnRevenueAmt}}</AnnRevenueAmt>\n                <CRARec>\n                    <CRAStateCode>{{LnAdd.RegDetail.CRARec.CRAStateCode}}</CRAStateCode>\n                    <CRACountyCode>{{LnAdd.RegDetail.CRARec.CRACountyCode}}</CRACountyCode>\n                    <CRACenTract>{{LnAdd.RegDetail.CRARec.CRACenTract}}</CRACenTract>\n                    <CRASMSACode>{{LnAdd.RegDetail.CRARec.CRASMSACode}}</CRASMSACode>\n                    <CRAIncmLvl>{{LnAdd.RegDetail.CRARec.CRAIncmLvl}}</CRAIncmLvl>\n                    <CRALoc>{{LnAdd.RegDetail.CRARec.CRALoc}}</CRALoc>\n                </CRARec>\n            </RegDetail>\n        </AcctAdd>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>",
    "xml_error_path": "s:Envelope/s:Body/s:Fault/detail/HdrFault/FaultRecInfoArray/FaultMsgRec/ErrDesc",
    "validation_spec": "{}",
    "xml_success_path": "s:Envelope/s:Body/LnAppRgtrAddResponse/LnAppId",
    "request_body_spec": "{\n    AccountId: {\n        AcctId: (.loan_number // \"\"),\n        AcctType: \"L\"\n    },\n    LnAdd: {\n        LnInfoRec: {\n            Term: {\n                TermCnt: (.loan_approval.approved_term // null),\n                TermUnits: \"Months\"\n            },\n            RemPmtCnt: (.loan_approval.approved_term // null),\n            PmtTerm: \"001\",\n            PmtDayOfMonth:( \n                if (\n                    (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"29\")\n                    or (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"30\")\n                    or (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"31\")\n                ) then (.loan_approval.approved_first_payment_date) \n                else null \n                end\n            ),\n            PmtCode: (((.pricing_details[] | select(.term_position == \"term_1\") | $repaymentTypeMapping[.repayment_type]) // null)),\n            PmtAmt: (\n                (.loan_interfaces[] \n                | select(.is_latest==true and .interface_type==\"sherman\") \n                |(\n                    (.details.outLOAN_BUILDER.AmTable.AmLine[] \n                    | select(.Idx==\"1\")) | .Pmt | tonumber // null\n                ))\n            ),\n            PIAmt: ((\n                .loan_interfaces[] | select(.is_latest==true and .interface_type==\"sherman\") \n                |((.details.outLOAN_BUILDER.AmTable.AmLine[] \n                | select(.Idx==\"1\")) | .Pmt | tonumber // null)\n            )),\n            OrigBal: (.approved_amount // \"\"),\n            OpenDt: (now | strftime(\"%Y-%m-%d\")),\n            OffCode: (.details.cra_details?.branch_code // \"\"),\n            NxtSchedPmtDt: (.loan_approval.approved_first_payment_date // \"\"),\n            MatDt: (.maturity_date // \"\"),\n            IntRate: (.loan_approval.approved_rate/100 // \"\"),\n            IntBasis: ($accuralMapping[.accrual_method | tostring] // null),\n            BrCode: \"51\",\n            ProdCode: \"26\",\n            AcctStat: \"4\",\n            CustId: (.loan_relations[] | select(.is_primary_borrower == true) | .external_customer_id // \"\"),\n            OddDaysIntBasis: \"B\"\n        },\n        LnAcctInfo: {\n            VehicleId: ((.collaterals[] | select(.category==\"vehicles\") | .details.vin) // null),\n            SubPrimeLnCode: \"N\",\n            State: (.loan_relations[] | select(.is_primary_borrower == true) | .state_of_establishment // \"\"),\n            PurpCode: \"98\",\n            PrtPastDueNotCode: \"Y\",\n            PrtCouponBook: \"N\",\n            OrigLnToValRatio: (if .approved_amount and .total_collateral_value_v2 then ((.approved_amount / .total_collateral_value_v2)* 10000  | round  / 10000) else null end),\n            LateChgCode: \"CL1\",\n            DeptCode: \"C\",\n            CurLnToValRatio: (if .approved_amount and .total_collateral_value_v2 then ((.approved_amount / .total_collateral_value_v2)* 10000  | round  / 10000) else null end),\n            CrRatingCode: \"5\",\n            CollatCode: \"14\",\n            AnnIncmAmt: (.cra_gross_annual_revenue // null),\n            AcctClsfCode: \"Q\",\n            CombLTV: (if .approved_amount and .total_collateral_value_v2 then ((.approved_amount / .total_collateral_value_v2)* 10000  | round  / 10000) else null end),\n            CrScoreId: (.fico_score // null),\n            MoIncmAmt: ((.cra_amount/12) | round // null),\n            NumBorw: ( ([.loan_relations[] | select(.relation_type == \"borrower\")] | length) // null),\n            LangType: \"English\",\n            CrRatingCode: \"5\",\n            BorwInfoArray: {\n                BorwInfo: {\n                    BorwFICOId: (.fico_score // null)\n                }\n            },\n            CrBureauRptCode: \"N\"\n        },\n        LnBalDtInfo: {\n            FirstPmtDt: (.loan_approval.approved_first_payment_date // \"\"),\n        },\n        LnPmtInfo: {\n            UsePmtSusp: \"N\",\n            BilLeadDays: \"15\"\n        },\n        LnRateInfo: {\n            RateVarCode: ( \n                .pricing_details[] | select(.term_position == \"term_1\") \n                |(\n                    if .differential_rate == null \n                        then null\n                    else\n                        if .differential_rate > 0\n                            then \"Positive\"\n                        elif .differential_rate < 0\n                            then \"Negative\"\n                        else null\n                        end\n                    end\n                )\n            ),\n            RateRevTermUnits: \"day\",\n            RateRevTerm: 1,\n            OrigIdxVal: ((.pricing_details[] | select(.term_position == \"term_1\") | (.prime_rate)/100) // null),\n            RateVar: (\n                (.pricing_details[] | select(.term_position == \"term_1\") | (.differential_rate)/100) // null\n            ),\n            RateFlr: ((.min_rate /100) *100 | round / 100 // null),\n            RateCeil: (if(.max_rate) then .max_rate /100 else null end),\n        },\n        LnRealEstateInfo: (.collaterals[0] | \n            { \n                PropStreet: ( .collateral_address |  \"\\(.address_line_1) \\(.address_line_2)\"),\n                FloodInsurCode: (\n                    if .collaterals[0].is_flood_search_required == true\n                        then \"Y\"\n                    elif .collaterals[0].is_flood_search_required == false\n                        then \"N\"\n                    else null\n                    end\n                ),\n                ApprDt: ( if (.is_appraisal_required == true) then .collateral_appraisal.details?.report_due_date else null end),\n                PropCounty: (.collateral_address | .county // null ),\n                PropState: ( .collateral_address | .state // null ),\n                PropPostalCode: (.collateral_address | .zip_code // null ),\n                PropCity: (.collateral_address | .city // null ),\n                ApprVal: ( if (.is_appraisal_required == true) then .collateral_appraisal.details.report_price else null end // null )\n            }\n        ),\n        LnRegRptInfo: {\n            NAICSCode: (.loan_relations[] | select(.is_primary_borrower == true) | .naics_code // null),\n            CRARec: (.details.geocoding_details[0] | \n                {\n                    CRAStateCode: (.details.cra_details?.state_code // null),\n                    CRACountyCode: (.county_code // null),\n                    CRACenTract: (.tract_code // null),\n                    CRASMSACode: (.MSA_code // null),\n                    CRALoc: 1,\n                    CRAIncmLvl: 1\n                }\n            ),\n            CallRptCode: \"4A\",\n            Req1098: \"NotReq\",\n            SBAGuarPct: ((if (.product.product_code | IN(\"EL_LOC\",\"EL_TL\",\"7A_TL\")) then .sba_express_details.sba_guaranty_percent /100 else null end)),\n            SBAGuarId: (if (.product.product_code | IN(\"EL_LOC\",\"EL_TL\",\"7A_TL\")) then .sba_number else null end),\n            SBABasisPts: (if (.product.product_code | IN(\"EL_LOC\",\"EL_TL\",\"7A_TL\")) then (if (.approved_amount <= 150000) then 1.50 else 3.00 end) else null end)\n            CRARec: (\n                $root.geocoding_details[0] | \n                {\n                    CRAStateCode: ($root.details.cra_details?.state_code // \"\"),\n                    CRACountyCode: (.county_code // \"\"),\n                    CRACenTract: (.tract_code // \"\"),\n                    CRASMSACode: (.MSA_code // \"\"),\n                    CRALoc: 1,\n                    CRAIncmLvl: 1,\n                }\n            ),\n        }\n    }\n}",
    "response_body_spec": "{ \n apiSuccess: .apiSuccess,\n errors: { \n errorNum: (if (.errors.errorNum != \"\" and .errors.errorNum != null) then .errors.errorNum else null end),\n errorMsg: ((if (.errors.errorNum != \"\" and .errors.errorNum != null) then .errors.errorMsg.Error else null end)) \n },\n responses: (if .apiSuccess == true and .responses.Id then [\n { \n status: .responses.Id \n }\n ] else [] end)\n}",
    "request_body_spec_config": "{\n \"repaymentTypeMapping\": {\n \"principal_and_interest\": 0,\n \"interest_only\": 2\n },\n \"accuralMapping\": {\n \"310\": 1,\n \"320\": 0,\n \"201\": 3\n }\n}",
    "response_body_spec_config": "{}"
}